{
  "uofg": {
    "title": "University of Glasgow",
    "location": "Scotland, United Kingdom",
    "degree": "BSc Honours in Software Engineering (Double Degree)",
    "specialization": "Parallel and Distributed Systems",
    "date": "Sep 2023 - May 2025",
    "gpa": "Expected 1st",
    "achievement": [
      "Participated in Code Olympics 2024, a 12-Hour Hackathon held on Saturday 27th January 9 am - 9 pm.",
      "Led the COMPSCI4047 Team Project (H) with Thales UK Ltd as Scrum Master, driving agile collaboration through Scrum methodologies. Effective communication and streamlined project management ensured efficient milestone completion."
    ],
    "color": "#003865"
  },
  "kmitl": {
    "title": "King Mongkut's Institute of Technology Ladkrabang",
    "location": "Bangkok, Thailand",
    "degree": "BEng in Software Engineering (Double Degree)",
    "specialization": "",
    "date": "Aug 2021 - Aug 2023",
    "gpa": "3.36",
    "achievement": [
      "AI Lab Open House Staff of KMITL - Played a crucial role in educating students about Artificial Intelligence, offering an overview of its core principles and practical applications. Additionally, I had the privilege of presenting my professor's advanced AI project, giving students a firsthand look at cutting-edge research and innovation.",
      "Vice-President of KMITL SE13 - Assumed the role of mentoring KMITL freshmen in Python programming during the SE14 Pre-Session, my guidance played a crucial role in helping students who were new to programming establish a strong foundation in Python."
    ],
    "color": "#e35205"
  },
  "42bkk": {
    "title": "42 Bangkok",
    "location": "Bangkok, Thailand",
    "degree": "Coding school from France",
    "specialization": "",
    "date": "Jul 2022 - May 2023",
    "gpa": "",
    "achievement": ["Passed C Piscine with level 8, and became Cadet."],
    "color": "#2bb9bc"
  },
  "sk": {
    "title": "Suankularb Wittayalai School",
    "location": "Bangkok, Thailand",
    "degree": "Science - Mathematics",
    "specialization": "",
    "date": "May 2018 - May 2021",
    "gpa": "3.61",
    "achievement": [
      "Collaborated with a team of 3 members to develop a strategic role-playing video game using Unreal Engine's Blueprints Visual Scripting, VRoid Studio for 3D avatar creation, and Blender for animation. The project was designed to provide teenagers with an escape from reality, offering relaxation and stress relief.",
      "Awarded the 'Scholarship of Academic Excellence' from The Court of Justice Savings and Credit Cooperative Limited.",
      "Awarded the 'Distinction in Academic Performance' from Suankularb Wittayalai School for 2 consecutive years",
      "Awarded the 'Scholarship of Academic Excellence' from Suankularb Wittayalai Foundation."
    ],
    "color": "#fb6ab3"
  },
  "ksp": {
    "title": "Kasintorn St.Peter School",
    "location": "Bangkok, Thailand",
    "degree": "Science - Mathematics",
    "specialization": "",
    "date": "May 2013 - May 2018",
    "gpa": "3.95",
    "achievement": [
      "Awarded the 'Gold Medal Award of Academic Excellence' for 3 consecutive years.",
      "Awarded the '1st Prize Gold Medal' in the Scientific Genius Competition",
      "Awarded the '1st Prize Gold Medal' in the Astronomy Quiz Competition."
    ],
    "color": "#e3b04c"
  },
  "stfx": {
    "title": "St.Francis Xavier School",
    "location": "Bangkok, Thailand",
    "degree": "Science - Mathematics",
    "specialization": "",
    "date": "May 2008 - May 2013",
    "gpa": "",
    "achievement": [],
    "color": "#2906c2"
  }
}
